{"type":"album","art_id":2276574067,"new_desc_format":1,"is_set_price":null,"upc":null,"release_date":"28 Oct 2016 00:00:00 GMT","artist":"CARLA DAL FORNO","publish_date":"02 Aug 2016 13:01:15 GMT","new_date":"02 Aug 2016 10:39:19 GMT","minimum_price_nonzero":6.0,"minimum_price":6.0,"require_email":null,"title":"You Know What It's Like","featured_track_id":3966576502,"credits":"Songs by Carla dal Forno\r\nRecorded in Melbourne and Berlin, 2015-16\r\n\r\nProduced by Carla dal Forno & Tarquin Manek","require_email_0":null,"mod_date":"28 Oct 2016 09:15:07 GMT","band_id":659878740,"auto_repriced":null,"purchase_url":null,"download_pref":2,"download_desc_id":null,"about":"You Know What It’s Like is an album for inbetween days, and occupies inbetween states: plain-speaking pop, disorientated by dub. Psychedelic folk delivered with (post-)punk economy. Drifting in space while still tethered to the ground. Astral tones blurred with earth sounds: wood, bone, breath, skin, dirt. Ending and beginning, dying and becoming. Longing for adventure and an unquiet life. Struggling to get out of bed.\r\n\r\nThis is Carla dal Forno’s debut solo album, following time in cult Melbourne group Mole House and an earlier association with Blackest Ever Black as a member of F ingers and Tarcar. Her voice is an extraordinary instrument: both disarmingly conversational and glacially detached. It has something of the bedsit urbanity of Anna Domino, Marine Girls, Antena, or Helen Johnstone - stoned and deadpan - but it can also summon a gothic intensity that Nico or Kendra Smith would approve of. This voice is the perfect embodiment of dal Forno's emotionally ambiguous songs: their lyrics rooted in the everyday, observing and exposing a series of uncomfortable truths. This voice asks difficult questions of singer, subject, and sung-to.\r\n\r\nAnd of course there are no simple answers. Singles ‘Fast Moving Cars’ and ‘What You Gonna Do Now?’ weigh up claustrophobia against loneliness, inertia against acceleration, doubling down versus taking off; the title track acknowledges the provisional nature of love and “real” intimacy, then decides to brave it anyway. By the time we arrive at the startlingly sparse ‘The Same Reply’, the impermanence of all things is something that can no longer be tolerated, and the sense of dejection is absolute.\r\n\r\nThe vocal-led pieces are interspersed with richly evocative instrumentals, like Eno’s Another Green World reimagined in shades of brown and blue. Smothered in tape-hiss and reverb, the seasick synthesizer miniatures ‘Italian Cinema’ and ‘Dragon Breath’ channel the twilit DIY whimsy of Flaming Tunes and Call Back The Giants. ‘DB Rip''s drum machine and bassline are pure Chicago house, but then its dark choral drones nod to Dalis Car's dreams of blood-spattered Cornwall stone. ‘Dry The Rain’ drinks from a stream of eldritch, home-brewed moon musick that runs through Coil, In Gowan Ring, Third Ear Band, even the Raincoats’ Odyshape, and into the woods.\r\n\r\nWondering and wandering. Wounding and consoling. Looking forward, looking back. Saying it like it is, making it up as we go along. It can't last forever. You can't have it all. You know what it's like.","private":null,"purchase_title":null,"selling_band_id":659878740,"set_price":7.0,"audit":0,"id":2641447131,"killed":null},

